{
  "title": "Fast Retailing Job Descriptions",
  "outline": [
    {
      "level": "H1",
      "text": "Fast Retailing Job Descriptions",
      "page": 1,
      "score": 6,
      "y_position": 90.6567153930664
    },
    {
      "level": "H2",
      "text": "Digital Business Reform Department (IT)",
      "page": 1,
      "score": 6,
      "y_position": 105.05670928955078
    },
    {
      "level": "H2",
      "text": "Company Overview Fast Retailing Group aims to become the world's best apparel group by transforming its business operations into a “Digital Consumer Retail Company” beyond the retail framework. We are actively investing in and focusing on Digitizing our operations and transforming the business globally. The IT Department at Fast Retailing handles e-commerce platforms, mobile shopping platforms, inventory management, and customer data visualization. In Fast Retailing, we are building microservices to support store and e-commerce operations. Our microservices are core parts of our business. We offer our talents a career journey in which the goal is to become not just a tech leader but to be a business leader. By providing diverse experiences in different roles, we expect you to develop a wide view of how the company works and lead Fast Retailing Group with strong business acumen. We are open for the following positions ● Software Developer",
      "page": 1,
      "score": 4,
      "y_position": 150.46914672851562
    },
    {
      "level": "H2",
      "text": "● Data Engineer",
      "page": 1,
      "score": 4,
      "y_position": 370.5531311035156
    },
    {
      "level": "H3",
      "text": "● Front-end Engineer",
      "page": 1,
      "score": 3,
      "y_position": 385.20159912109375
    },
    {
      "level": "H3",
      "text": "● Backend Engineer",
      "page": 1,
      "score": 3,
      "y_position": 399.85003662109375
    },
    {
      "level": "H3",
      "text": "● Mobile Application Engineer",
      "page": 1,
      "score": 3,
      "y_position": 414.49847412109375
    },
    {
      "level": "H3",
      "text": "● QA Engineer",
      "page": 1,
      "score": 3,
      "y_position": 429.14691162109375
    },
    {
      "level": "H2",
      "text": "● Data Scientist",
      "page": 1,
      "score": 4,
      "y_position": 443.79534912109375
    },
    {
      "level": "H3",
      "text": "You will submit your preference but we cannot guarantee the position; we will assess your eligibility through the screening process and will decide your position after joining the company. Each team’s available slot is 1-3 What we can offer ● Your first job in Tokyo, Japan",
      "page": 1,
      "score": 3,
      "y_position": 460.30706787109375
    },
    {
      "level": "H2",
      "text": "● Flexible working hours",
      "page": 1,
      "score": 4,
      "y_position": 547.5550537109375
    },
    {
      "level": "H3",
      "text": "● Opportunities to work on challenging projects that have a high global impact on Japan's biggest apparel company",
      "page": 1,
      "score": 3,
      "y_position": 562.2034912109375
    },
    {
      "level": "H3",
      "text": "● Opportunities to choose your own technology stack and improve your skills",
      "page": 1,
      "score": 3,
      "y_position": 591.5003662109375
    },
    {
      "level": "H3",
      "text": "● Company discount on UNIQLO, GU, and Theory products",
      "page": 1,
      "score": 3,
      "y_position": 606.1488037109375
    },
    {
      "level": "H3",
      "text": "Process ● Online application",
      "page": 1,
      "score": 3,
      "y_position": 637.5296630859375
    },
    {
      "level": "H3",
      "text": "● Resume screening",
      "page": 1,
      "score": 3,
      "y_position": 665.9632568359375
    },
    {
      "level": "H3",
      "text": "● Online tests (Data Structures and algorithms, aptitude and personality test)",
      "page": 1,
      "score": 3,
      "y_position": 680.6116943359375
    },
    {
      "level": "H3",
      "text": "● Online or face-to-face interview (1-3 times) (including technical interview)",
      "page": 1,
      "score": 3,
      "y_position": 695.2601318359375
    },
    {
      "level": "H3",
      "text": "● Final Executive Officer Interview",
      "page": 1,
      "score": 3,
      "y_position": 709.9085693359375
    },
    {
      "level": "H1",
      "text": "1. Software Developer",
      "page": 2,
      "score": 9,
      "y_position": 87.4990234375
    },
    {
      "level": "H2",
      "text": "Overview ● Understand the priorities of business requirements and realize and provide high-quality services on a limited schedule.",
      "page": 2,
      "score": 4,
      "y_position": 121.255859375
    },
    {
      "level": "H2",
      "text": "● Design, develop, test, and release new or existing functions for the assigned service. Maintenance, monitoring, troubleshooting, and bug repair (24x7).",
      "page": 2,
      "score": 4,
      "y_position": 164.337890625
    },
    {
      "level": "H3",
      "text": "● Implement system improvements (refactoring, optimal technology, architecture selection /introduction/evaluation, load measurement, and performance improvement) for the service in charge.",
      "page": 2,
      "score": 3,
      "y_position": 193.634765625
    },
    {
      "level": "H2",
      "text": "● Work with business, design, and engineering teams to build world-class native applications that redefine the customer shopping experience.",
      "page": 2,
      "score": 5,
      "y_position": 237.580078125
    },
    {
      "level": "H2",
      "text": "● Have a variety of opportunities for developing the service not only for our customers but also for our store staff to improve their daily operations.",
      "page": 2,
      "score": 4,
      "y_position": 266.876953125
    },
    {
      "level": "H2",
      "text": "● Depending on customer trends and business conditions, projects change rapidly in a short time, and opportunities to work on diverse projects.",
      "page": 2,
      "score": 4,
      "y_position": 296.173828125
    },
    {
      "level": "H2",
      "text": "● Based on our philosophy and objectives of changing clothes, changing conventional wisdom, and change the world, the path to problem-solving logically and speedily comes in.",
      "page": 2,
      "score": 4,
      "y_position": 325.470703125
    },
    {
      "level": "H3",
      "text": "● As a global headquarters, we will involve multiple brands of UNIQLO Global and Fast Retailing Group to promote IT service planning and system construction projects in the E-commerce business.",
      "page": 2,
      "score": 3,
      "y_position": 354.767578125
    },
    {
      "level": "H2",
      "text": "Expected role ● Being able to come up with realistic solutions that meet business requirements, not just technical ideals.",
      "page": 2,
      "score": 4,
      "y_position": 415.4453125
    },
    {
      "level": "H2",
      "text": "● Responding to demands that are difficult to achieve, you can work forward and continue to challenge without giving up.",
      "page": 2,
      "score": 5,
      "y_position": 458.52734375
    },
    {
      "level": "H2",
      "text": "Preferred skills and experiences ● Front-end development experience using HTML, CSS, React, JavaScript, npm, Node JS, AngularJS or Vue.js, Web API, and knowledge of frontend API (ECMAScript 6, DOM API, Navigation API Canvas, etc)",
      "page": 2,
      "score": 4,
      "y_position": 504.556640625
    },
    {
      "level": "H2",
      "text": "● Understanding and having experience with parallel and asynchronous processing (AJAX, Promise, WebWorkers, WebSockets) and operation experience on Linux",
      "page": 2,
      "score": 4,
      "y_position": 562.287109375
    },
    {
      "level": "H3",
      "text": "● Software configuration management (version control [Git], build management [webpack. Jenkins])",
      "page": 2,
      "score": 3,
      "y_position": 591.583984375
    },
    {
      "level": "H3",
      "text": "● Full Software Testing Life Cycle experience including system testing, regression testing, integration testing, end-to-end testing, UAT, and database testing",
      "page": 2,
      "score": 3,
      "y_position": 620.880859375
    },
    {
      "level": "H3",
      "text": "● Experience in REST API design and implementation and experience with",
      "page": 2,
      "score": 3,
      "y_position": 650.177734375
    },
    {
      "level": "H3",
      "text": "TypeScript/JavaScript/Node.js Golang Java /Spring Boot React Shell scripts / ElasticSearch etc.",
      "page": 2,
      "score": 3,
      "y_position": 666.689453125
    },
    {
      "level": "H2",
      "text": "● Docker Containers",
      "page": 2,
      "score": 4,
      "y_position": 679.474609375
    },
    {
      "level": "H3",
      "text": "● Amazon Web Services, Unix, PostgreSQL, MySQL, MongoDB, Fluentd, Logstash, Kibana. Experience in test data creation and SQL query writing (PostgreSQL & Oracle DB is preferred)",
      "page": 2,
      "score": 3,
      "y_position": 694.123046875
    },
    {
      "level": "H3",
      "text": "● Coding and review experience for performance, maintainability, and security",
      "page": 2,
      "score": 3,
      "y_position": 723.419921875
    },
    {
      "level": "H1",
      "text": "2. Data Engineer",
      "page": 3,
      "score": 10,
      "y_position": 87.4990234375
    },
    {
      "level": "H2",
      "text": "Overview FAST RETAILING Co., Ltd. is constantly improving the user experience with the aim of improving the user experience, and we believe that data science will make a major contribution to it. There are a wide variety of data sources such as actual stores, e-commerce, mission-critical systems, and microservices of various brands and countries under Fast Retailing. It is imperative for data engineers to create a smart big data platform that can collect and store vast amounts of data safely and accurately while using the latest technology, and to quickly provide high-quality data to data scientists. As a data engineer, your mission would be building a smart big data infrastructure that can collect and store huge data in a safe, correct approach, and provide high-quality data to data scientists quickly using cutting-edge data technology. Expected role ● Construction and operation of big data infrastructure such as Data Lake / Data Catalog / DWH",
      "page": 3,
      "score": 3,
      "y_position": 120.03515625
    },
    {
      "level": "H2",
      "text": "● Development of data common processing program",
      "page": 3,
      "score": 4,
      "y_position": 325.470703125
    },
    {
      "level": "H3",
      "text": "● Construction and operation of a batch real-time processing system for analysis",
      "page": 3,
      "score": 3,
      "y_position": 340.119140625
    },
    {
      "level": "H3",
      "text": "● Construction and operation of anomaly detection infrastructure",
      "page": 3,
      "score": 3,
      "y_position": 354.767578125
    },
    {
      "level": "H3",
      "text": "Preferred skills and experiences ● Data analysis backend processing using statistical methods in cloud infrastructure and its operation experience",
      "page": 3,
      "score": 3,
      "y_position": 387.369140625
    },
    {
      "level": "H2",
      "text": "● Experience in data engineering/ science or other related backend development/ operations",
      "page": 3,
      "score": 5,
      "y_position": 430.451171875
    },
    {
      "level": "H3",
      "text": "● Cloud familiarity with the Hadoop ecosystem or worked with large data storage or warehousing solutions including NoSQL, AWS EMR / GCP Bigquery, Elasticsearch, data marts, data lakes, etc.",
      "page": 3,
      "score": 3,
      "y_position": 445.099609375
    },
    {
      "level": "H2",
      "text": "● Worked with at least one programming language including Python, Scala, and Java.",
      "page": 3,
      "score": 4,
      "y_position": 474.396484375
    },
    {
      "level": "H2",
      "text": "3. Front-end Engineer Overview As a front-end engineer, you will help us design, develop, maintain, and support web application development for EC. Our EC Web Frontend team is seeking a passionate engineer who can join our team to develop applications with a robust operational structure. Our mission is to apply the latest web technologies globally by making use of standards and best practices. We also develop new features to improve the overall customer experience and to continuously influence the industry. Aside from using all of the web fundamentals, the candidate will be involved in designing and maintaining scalable architecture with an open mind. We are building a global system that handles high volumes of incoming traffic. Expected role ● Work with other front-end engineers, product managers, project managers, UI/UX designers, and backend engineers to design, develop, and maintain EC consumer-facing web applications.",
      "page": 4,
      "score": 8,
      "y_position": 72.8505859375
    },
    {
      "level": "H2",
      "text": "● Create code that meets our standards and makes use of best practices for a highly-scalable and highly operational web environment.",
      "page": 4,
      "score": 5,
      "y_position": 296.173828125
    },
    {
      "level": "H3",
      "text": "● Help fellow engineers by doing code reviews, pair programming, and contributing something new to the team in order to establish a good and stable development culture.",
      "page": 4,
      "score": 3,
      "y_position": 325.470703125
    },
    {
      "level": "H3",
      "text": "● Create and maintain technical documentation.",
      "page": 4,
      "score": 3,
      "y_position": 354.767578125
    },
    {
      "level": "H3",
      "text": "● Improve the overall performance and user experience of the application.",
      "page": 4,
      "score": 3,
      "y_position": 369.416015625
    },
    {
      "level": "H2",
      "text": "Preferred skills and experiences ● Front-end development experience using HTML / CSS / JavaScript / npm",
      "page": 4,
      "score": 4,
      "y_position": 415.4453125
    },
    {
      "level": "H3",
      "text": "● Experience using AngularJS or Vue.js",
      "page": 4,
      "score": 3,
      "y_position": 443.87890625
    },
    {
      "level": "H3",
      "text": "● Experience using Web API (REST, JSON, CORS)",
      "page": 4,
      "score": 3,
      "y_position": 458.52734375
    },
    {
      "level": "H3",
      "text": "● Front-end development experience using React / Redux, Gulp / WebPack",
      "page": 4,
      "score": 3,
      "y_position": 473.17578125
    },
    {
      "level": "H3",
      "text": "● Knowledge of frontend API (ECMAScript 6, DOM API, Navigation API Canvas, etc.)",
      "page": 4,
      "score": 3,
      "y_position": 487.82421875
    },
    {
      "level": "H3",
      "text": "● Understanding and experience with parallel and asynchronous processing (AJAX, Promise, WebWorkers, WebSockets)",
      "page": 4,
      "score": 3,
      "y_position": 502.47265625
    },
    {
      "level": "H3",
      "text": "● Research and operation experience on Linux",
      "page": 4,
      "score": 3,
      "y_position": 531.76953125
    },
    {
      "level": "H2",
      "text": "● Software configuration management (version control [Git], build management [webpack. Jenkins])",
      "page": 4,
      "score": 4,
      "y_position": 546.41796875
    },
    {
      "level": "H2",
      "text": "4. Backend Engineer Overview As a back-end engineer (Microservices), you will develop new microservices, application servers, etc., and maintain existing ones. This includes understanding the business requirements, designing the API, implementing the functionality, testing, and eventually helping to deploy the solution to the production environment. You will also be part of a scrum team and actively practice test-driven Development. We have teams in different locations whose members come from various cultural backgrounds, and we strive to implement the best solutions for the given requirements. We are looking forward to expanding the team size in order to fulfill all our requirements. Preferred skills and experiences ● Experience in REST API design and implementation ● Technology Stack: TypeScript/ JavaScript/ Node.js Golang Java/ Spring Boot React Shell scripts ● Docker Containers ● Test-Driven Development Git, Github Scrum, Kanban, JIRA, Confluence, Zenhub ● Amazon Web Services, Unix, PostgreSQL, MySQL, MongoDB, Fluentd, ElasticSearch, Logstash,",
      "page": 5,
      "score": 7,
      "y_position": 72.8505859375
    },
    {
      "level": "H2",
      "text": "Kibana",
      "page": 5,
      "score": 5,
      "y_position": 343.203125
    },
    {
      "level": "H2",
      "text": "5. Mobile Application Engineer Overview Design and implement applications considering user experience, performance, maintainability, cost, and up-to-date technologies. Opportunity to develop and ship the in-house applications of our brands including UNIQLO and GU for our customers around the globe. Analyze users and make improvement plans with our business planners and UI/UX designers for the expansion of our business. Develop applications for FR employees to improve business operations and customer support. Recently the importance of application development in the company has increased rapidly with the expansion of our business and innovation of mobile devices. It's a very attractive position where you can deliver your achievements to customers and staff around the world. As a Mobile application engineer, you will work closely with our business, design, and engineering teams to build world-class native mobile applications that redefine the customer shopping experience. You have a variety of opportunities for developing the service not only for our customers but also for our store staff to improve their daily operations. The mobile applications would be E-commerce applications having functionality and layout similar to other E-commerce sites like Amazon, Flipkart, etc. Expected role ● Develop mobile applications for FR brand customers. ● Develop mobile applications for business operations. ● Build an effective development environment utilizing common frameworks. ● Required skills and experiences ● UI design and implementation based on iOS Human Interface Guidelines / Material Design ● Basic knowledge of Web technologies (HTTP, HTML/CSS/JavaScript, etc.). Preferred skills and experiences ● Both iOS and Android development experiences ● Experience in cross-platform development with Web technologies (e.g. React Native). ● Experience of Web site development with modern frameworks such as React, AngularJS, Vue.js,",
      "page": 6,
      "score": 7,
      "y_position": 74.869140625
    },
    {
      "level": "H2",
      "text": "etc.",
      "page": 6,
      "score": 5,
      "y_position": 520.205078125
    },
    {
      "level": "H2",
      "text": "customer acquisition.",
      "page": 6,
      "score": 4,
      "y_position": 578.798828125
    },
    {
      "level": "H2",
      "text": "● Experience in the establishment of the development environment, and standardization.",
      "page": 6,
      "score": 4,
      "y_position": 591.583984375
    },
    {
      "level": "H2",
      "text": "6. QA Engineer Overview The QA Engineer is responsible for designing, implementing, and executing test cases for system tests, integration tests, E2E tests & UAT phases. As a QA engineer, you will play a critical role in ensuring the overall quality of frontend, and backend supporting systems/microservices of our e-commerce site. The ideal candidate must be a self-starter with excellent technical, analytical, organizational, and communication skills along with passion and drive to deliver quality products. Expected role Develop and execute manual test cases for system testing, integration testing, end-to-end testing, and UAT ● Create test data to identify, record, and track defects using Defect Tracking Tool (JIRA) ● Set up the test environment ● Work closely with the development team to diagnose issues, resolve defects, and ensure that",
      "page": 7,
      "score": 7,
      "y_position": 74.869140625
    },
    {
      "level": "H2",
      "text": "product releases follow project specifications",
      "page": 7,
      "score": 5,
      "y_position": 313.90625
    },
    {
      "level": "H3",
      "text": "● Create QA status reports ● Follow QA schedule / Adhere to deadlines ● Communicate with all business stakeholders, QA Manager, Business Analyst, ● Dev Team, UI/UX team, etc in a timely manner ● Take ownership in improving the QA process and drive for product quality ● Collaborate with international teams for both technical and non-technical issues Preferred skills and experiences ● Full Software Testing Life Cycle experience including system testing, regression testing, integration testing, end-to-end testing, UAT, and database testing",
      "page": 7,
      "score": 3,
      "y_position": 326.69140625
    },
    {
      "level": "H2",
      "text": "● Experience in test data creation and SQL query writing (PostgreSQL & Oracle DB is preferred)",
      "page": 7,
      "score": 4,
      "y_position": 474.396484375
    },
    {
      "level": "H3",
      "text": "● Experience in API testing & batch testing using WinScp, Putty, and other API testing tools",
      "page": 7,
      "score": 3,
      "y_position": 489.044921875
    },
    {
      "level": "H2",
      "text": "● Experience in testing web-based applications (e-commerce is preferred)",
      "page": 7,
      "score": 4,
      "y_position": 503.693359375
    },
    {
      "level": "H2",
      "text": "7. Data Scientist Overview As a Data Scientist, we want you to lead our data analysis efforts of the Digital Business Transformation Services Department, being at the very core of achieving our goals by not only promoting globalization, cloud migration, and mobilization using leading-edge technology, is the proactive IT itself. The mission of the Digital Business Transformation Services Department is to define the \"ideal\" form of business from the customer's perspective and to lead and realize business innovation using the latest IT technologies. In order to realize the \"Ariake Project\", in addition to EC and store systems, in-house development of enterprise systems is also being promoted at an accelerated pace. The data analysis team is a highly skilled data scientist working together to improve the sophistication of product planning, refine demand forecasts, optimize the supply chain, and so on. Expected role Understanding each business process and collaborating with each member of the project to design analysis, data collection, pre-processing, data analysis, and evaluation of the results to solve business issues Preferred skills and experiences ● Completion of college-level mathematics (statistics, analysis, linear algebra)",
      "page": 8,
      "score": 7,
      "y_position": 89.517578125
    },
    {
      "level": "H2",
      "text": "● Understand the algorithms of general machine learning methods, and be able to implement them appropriately.",
      "page": 8,
      "score": 4,
      "y_position": 415.802734375
    },
    {
      "level": "H2",
      "text": "● Understand linear/non-linear programming problems and be able to model them by yourself.",
      "page": 8,
      "score": 4,
      "y_position": 445.099609375
    },
    {
      "level": "H3",
      "text": "● Ability to perform the analysis required for practical use using a programming language (GUI experiences such as Excel add-in or SPSS is not included)",
      "page": 8,
      "score": 3,
      "y_position": 459.748046875
    }
  ]
}